[{"App Name": "Mastodon", "Request Number": "#125", "Title": "Domain verification not displayed", "Author": "cassidyjames", "Posted Time": "May 4, 2022", "Last Comment Time": "Nov 27, 2022", "Initial Comment": "Domain verification shows on the web as described by @Gargron\n\nbut it doesn't appear in the app.", "CommitURL": "N/a", "Number of comments": 0, "CommentatorsNames": ["cassidyjames", "edent"], "Number of Commentators": 2, "All Comments": [{"Text: ": "Domain verification shows on the web asdescribed by @Gargron described by @Gargron   but it doesn't appear in the app.", "Images: ": ["https://user-images.githubusercontent.com/611168/166832338-2d915c90-74da-4417-bfb1-bc8557fcdbd2.png", "https://user-images.githubusercontent.com/611168/166832324-781c2b3e-1aa3-4e54-912e-b88b52b733ed.png"]}, {"Text: ": "See alsomastodon/mastodon-ios#312 mastodon/mastodon-ios#312", "Images: ": []}]}, {"App Name": "Mastodon", "Request Number": "#108", "Title": "No Delete and Redraft Option", "Author": "juliloving", "Posted Time": "May 2, 2022", "Last Comment Time": "Dec 30, 2022", "Initial Comment": "This is my favourite feature on the website, and I'd really like it here", "CommitURL": "N/a", "Number of comments": 2, "CommentatorsNames": ["juliloving", "cassidyjames", "grishka"], "Number of Commentators": 3, "All Comments": [{"Text: ": "This is my favourite feature on the website, and I'd really like it here", "Images: ": []}, {"Text: ": "Duplicate of#21; please see the discussion there. #21", "Images: ": []}, {"Text: ": "Duplicate of#21 Duplicate of #21", "Images: ": []}]}, {"App Name": "Mastodon", "Request Number": "#199", "Title": "Feature: Set language of post", "Author": "realpixelcode", "Posted Time": "Jun 16, 2022", "Last Comment Time": "Aug 13, 2023", "Initial Comment": "Just like in the Web UI, it should be possible to explicitly set the language for a post that one creates.", "CommitURL": "N/a", "Number of comments": 6, "CommentatorsNames": ["realpixelcode", "SeidChr", "mariotaku", "grishka", "mariotaku", "SeidChr", "realpixelcode"], "Number of Commentators": 7, "All Comments": [{"Text: ": "Just like in the Web UI, it should be possible to explicitly set the language for a post that one creates.", "Images: ": []}, {"Text: ": "Why is this not in the app??", "Images: ": []}, {"Text: ": "Can you assign this to me if it needs help? I think can implement this one.@grishka @grishka", "Images: ": []}, {"Text: ": "No, we don't need help right now. As this feature changes the UI, it needs to be designed by our UI/UX team.", "Images: ": []}, {"Text: ": "I see. This is a very useful feature. And I'll be looking forward to this one!", "Images: ": []}, {"Text: ": "Uninstalled the app now. Using PWA. No notifications, but i can set the language :D", "Images: ": []}, {"Text: ": "This feature has been implemented meanwhile. Just tap the 🌐 icon in the draft window.", "Images: ": []}]}, {"App Name": "Mastodon", "Request Number": "#37", "Title": "Add \"Unlisted\" option for toots.", "Author": "Xabellee", "Posted Time": "Apr 19, 2022", "Last Comment Time": "Mar 18, 2024", "Initial Comment": "Web Mastodon supports that feature, but in this app I cannot use it. In this app I can only use public, Followers only, Only people I mention.", "CommitURL": "/mastodon/mastodon-android/commit/f888091e22a4f7eff3a48b53b4731bd47ebb45f9/hovercard", "Number of comments": 2, "CommentatorsNames": ["Xabellee", "moertel", "Cassolotl"], "Number of Commentators": 3, "All Comments": [{"Text: ": "Web Mastodon supports that feature, but in this app I cannot use it. In this app I can only usepublic,Followers only,Only people I mention. public Followers only Only people I mention", "Images: ": []}, {"Text: ": "Some other threads (e.g. on the iOS app) talk about this being a deliberate design decision. Before anyone goes in to invest time in a PR, can the maintainers please clarify whether this is true? Edit: nevermind, meanwhile I found the linked PR and read the discouraging discussion within.", "Images: ": []}, {"Text: ": "This is now essential in light ofmastodon/mastodon#26344, which will make all public posts from \"discoverable\" accounts searchable. mastodon/mastodon#26344 mastodon/mastodon#26344", "Images: ": []}]}, {"App Name": "Mastodon", "Request Number": "#107", "Title": "Can't view image descriptions", "Author": "juliloving", "Posted Time": "May 2, 2022", "Last Comment Time": "Dec 30, 2022", "Initial Comment": "I know a screen reader can still read them, but it's important to me to see if there IS a description so I know if I can boost these posts to my disabled followers", "CommitURL": "N/a", "Number of comments": 2, "CommentatorsNames": ["juliloving", "realpixelcode", "grishka"], "Number of Commentators": 3, "All Comments": [{"Text: ": "I know a screen reader can still read them, but it's important to me to see if there IS a description so I know if I can boost these posts to my disabled followers", "Images: ": []}, {"Text: ": "I'd like to be able to view image descriptions without having to use a screen reader. 🤷 Maybe a duplicate?#100 #100", "Images: ": []}, {"Text: ": "Duplicate of#100 Duplicate of #100", "Images: ": []}]}, {"App Name": "Mastodon", "Request Number": "#131", "Title": "Add app shortcuts", "Author": "Poopooracoocoo", "Posted Time": "May 6, 2022", "Last Comment Time": "May 15, 2022", "Initial Comment": "Most useful one would be to make a new post. And perhaps shortcuts for all of the non-default tabs. Or perhaps search.\nSee https://developer.android.com/guide/topics/ui/shortcuts", "CommitURL": "/mastodon/mastodon-android/commit/558adc6936637adc7fd8efeb69acb6cd932e4e58/hovercard", "Number of comments": 0, "CommentatorsNames": ["Poopooracoocoo"], "Number of Commentators": 1, "All Comments": [{"Text: ": "Most useful one would be to make a new post. And perhaps shortcuts for all of the non-default tabs. Or perhaps search. Seehttps://developer.android.com/guide/topics/ui/shortcuts https://developer.android.com/guide/topics/ui/shortcuts", "Images: ": []}]}, {"App Name": "Mastodon", "Request Number": "#100", "Title": "Alt text on images not visible", "Author": "FediVideos", "Posted Time": "Apr 30, 2022", "Last Comment Time": "Jan 18, 2023", "Initial Comment": "There doesn't seem to be any way to view the alt text image descriptions?\nThis can contain important content, it would be good to have (for example) a long press expose the alt text, at least as an option in the context menu.", "CommitURL": "/mastodon/mastodon-android/commit/abdbab9d7bd3519d092370354689f24822071571/hovercard", "Number of comments": 8, "CommentatorsNames": ["FediVideos", "grishka", "realpixelcode", "sk22", "andria-dev", "RiderExMachina", "realpixelcode", "sk22", "realpixelcode"], "Number of Commentators": 9, "All Comments": [{"Text: ": "There doesn't seem to be any way to view the alt text image descriptions? This can contain important content, it would be good to have (for example) a long press expose the alt text, at least as an option in the context menu.", "Images: ": []}, {"Text: ": "There is currently no way tohave it displayed on screen, but you can hear it if you use a screen reader. have it displayed on screen", "Images: ": []}, {"Text: ": "How about displaying a native Android toast popup with the alt text after long-pressing the image?", "Images: ": []}, {"Text: ": "^ mentioned this issue by accident, sorry about this!", "Images: ": []}, {"Text: ": "I think a feature like the one described in the Mastodon web client repo would be great to add to the Android client. The iOS client also has the same issue.mastodon/mastodon#18394  mastodon/mastodon#18394", "Images: ": []}, {"Text: ": "How about displaying a native Android toast popup with the alt text after long-pressing the image? How about displaying a native Android toast popup with the alt text after long-pressing the image? You mean like how Tusky does it?", "Images: ": []}, {"Text: ": "How about displaying a native Android toast popup with the alt text after long-pressing the image?You mean like how Tusky does it? How about displaying a native Android toast popup with the alt text after long-pressing the image? How about displaying a native Android toast popup with the alt text after long-pressing the image? You mean like how Tusky does it? Yes, exactly. Tusky also displays the alt text in beneath the image in a “text container”; that would be an option too.", "Images: ": []}, {"Text: ": "Yes, exactly. Tusky also displays the alt text in beneath the image in a “text container”; that would be an option too. Yes, exactly. Tusky also displays the alt text in beneath the image in a “text container”; that would be an option too. well, that's what my PR already implements :D#129 #129", "Images: ": ["https://user-images.githubusercontent.com/6217438/202873208-95c22d6e-8014-4a4b-8e03-fd5cfbedc768.jpg"]}, {"Text: ": "Great! Love it! :)", "Images: ": []}]}, {"App Name": "Mastodon", "Request Number": "#139", "Title": "Image not fully visible when adding alt text", "Author": "sk22", "Posted Time": "May 6, 2022", "Last Comment Time": "Jun 1, 2023", "Initial Comment": "Only a cropped version of the image is displayed when adding an alt text - which makes it hard to actually describe the image.\nCould be more like on Twitter, where the image is actually scrollable, and the text area is fixed to the bottom.", "CommitURL": "N/a", "Number of comments": 2, "CommentatorsNames": ["sk22", "juliloving", "grishka"], "Number of Commentators": 3, "All Comments": [{"Text: ": "Only a cropped version of the image is displayed when adding an alt text - which makes it hard to actually describe the image.Could be more like on Twitter, where the image is actually scrollable, and the text area is fixed to the bottom.", "Images: ": ["https://user-images.githubusercontent.com/6217438/167163135-f41a842f-9df8-4ca8-b1e3-1762a09aa06f.jpg"]}, {"Text: ": "+1, I had this issue too many times!", "Images: ": []}, {"Text: ": "This was fixed in M3 redesign by allowing the image to be opened in a full-screen media viewer.", "Images: ": []}]}, {"App Name": "Mastodon", "Request Number": "#87", "Title": "Feature: (Behavior) Automatically display content with content warnings", "Author": "crawlserv", "Posted Time": "Apr 27, 2022", "Last Comment Time": "Oct 10, 2023", "Initial Comment": "Hi!\nThe only thing I miss from the official app compared to other apps such as Tusky is that I cannot change the behavior of automatically hiding content with content warnings. (Could be added as another option under \"Behavior\" in the Settings.)\nThanks!", "CommitURL": "/mastodon/mastodon-android/commit/4dea7d2a52b994fcda1399e119589c43a262060c/hovercard", "Number of comments": 6, "CommentatorsNames": ["crawlserv", "danielcherubini", "grishka", "sk22", "danielcherubini", "sk22", "ashwebcode"], "Number of Commentators": 7, "All Comments": [{"Text: ": "Hi!The only thing I miss from the official app compared to other apps such as Tusky is that I cannot change the behavior of automatically hiding content with content warnings. (Could be added as another option under \"Behavior\" in the Settings.)Thanks!", "Images: ": []}, {"Text: ": "This seems like a bug where the app ignores your content settings on your account. FYI you can change those settings on your account on the web Preferences > Appearance", "Images: ": ["https://user-images.githubusercontent.com/399473/166158729-cafb3d94-1889-4d2d-815a-c38ed31eee0d.png"]}, {"Text: ": "This seems like a bug where the app ignores your content settings on your account. This seems like a bug where the app ignores your content settings on your account. The code to read, let alone respect, this setting was never written in the first place 🤔", "Images: ": []}, {"Text: ": "If such option is implemented, the content warning should still be displayed somewhere (maybe above the toot), as content warnings often contain valuable extra information or are used like headings.", "Images: ": []}, {"Text: ": "Using content warnings as headings seems like a really bad use of content warnings. The idea is to say what content is in them so people who are sensitive to that kind of content can judge if they want to see it.. It's not meant to be used like some kind of extra thing that's part of the post behind it. If people are using content warnings like that, then they are using them wrong. I don't need content warnings. I'm not sensitive. But others are and I think it's a good feature to have.", "Images: ": []}, {"Text: ": "Using content warnings as headings seems like a really bad use of content warnings.The idea is to say what content is in them so people who are sensitive to that kind of content can judge if they want to see it..It's not meant to be used like some kind of extra thing that's part of the post behind it.If people are using content warnings like that, then they are using them wrong.I don't need content warnings. I'm not sensitive. But others are and I think it's a good feature to have. Using content warnings as headings seems like a really bad use of content warnings. The idea is to say what content is in them so people who are sensitive to that kind of content can judge if they want to see it.. It's not meant to be used like some kind of extra thing that's part of the post behind it. If people are using content warnings like that, then they are using them wrong. I don't need content warnings. I'm not sensitive. But others are and I think it's a good feature to have. well, lots of people are already using the content warnings \"wrong\", and it doesn't really matter, since every major mastodon app displays them in some way. i like having my content warnings extended by default as well, but completely hiding them would be counter-intuitive as people tend to put important information in there; some toots don't even make sense without the cw. and also, in code, the content warning is called \"spoiler text\", so there's some room for interpretation about how to use this field. you won't be able to make everyone use it \"correctly\" either way, so hiding the content warning would be a bad idea imo", "Images: ": []}, {"Text: ": "Is it possible to also apply this to notifications? It would be great to see the full text in the notification if the content warnings are set to expand", "Images: ": []}]}, {"App Name": "Mastodon", "Request Number": "#22", "Title": "Missing bookmarks", "Author": "imto1", "Posted Time": "Apr 15, 2022", "Last Comment Time": "Nov 27, 2022", "Initial Comment": "Cannot bookmark posts and also unable to see bookmarks. Please add this feature to Mastodon android.\nThanks.", "CommitURL": "/mastodon/mastodon-android/commit/4b2c94ab5268bb1ff0c6227edd1a8c06437459e7/hovercard", "Number of comments": 15, "CommentatorsNames": ["imto1", "imto1", "sk22", "da-bu", "grishka", "da-bu", "SamStephens", "3ter", "SamStephens", "3ter", "grishka", "grishka", "3ter", "SamStephens", "grishka", "SamStephens"], "Number of Commentators": 16, "All Comments": [{"Text: ": "Cannot bookmark posts and also unable to see bookmarks. Please add this feature to Mastodon android.Thanks.", "Images: ": []}, {"Text: ": "", "Images: ": ["https://user-images.githubusercontent.com/43239919/163548477-23d9b2fb-0583-4fe6-aeb2-d644a60b0e11.jpg", "https://user-images.githubusercontent.com/43239919/163548507-b5ea2efd-d2a2-4013-80ae-852429081249.jpg"]}, {"Text: ": "implemented this in my fork'sfeature/bookmarkbranch:master...sk22:feature/bookmarks(my fork's latest release has the feature!)though, the implementation is quite hacky, as apparently mastodon uses a different mechanism for the max id than just accepting the status' ids, requiring parsing the response header: feature/bookmark master...sk22:feature/bookmarks master...sk22:feature/bookmarks  GET https://mastodon.social/api/v1/bookmarks GET https://mastodon.social/api/v1/bookmarks GET https://mastodon.social/api/v1/bookmarks response contains: link: <https://mastodon.social/api/v1/bookmarks?max_id=268962>;  rel=\"next\",  <https://mastodon.social/api/v1/bookmarks?min_id=268992>;  rel=\"prev\" link: <https://mastodon.social/api/v1/bookmarks?max_id=268962>;  rel=\"next\",  <https://mastodon.social/api/v1/bookmarks?min_id=268992>;  rel=\"prev\" link: <https://mastodon.social/api/v1/bookmarks?max_id=268962>;  rel=\"next\",  <https://mastodon.social/api/v1/bookmarks?min_id=268992>;  rel=\"prev\"", "Images: ": []}, {"Text: ": "Hey, any updates on this one? I'm new to Mastodon and really like the app. This is the one feature I'm missing the most. 🙏", "Images: ": []}, {"Text: ": "Github issues are mostly for bug reports. Features that require new UI, as well as any other UI changes, are decided upon centrally and implemented in both iOS and Android apps more or less at the same time. This is also the reason why I don't merge pull requests that change the UI or add to it.", "Images: ": []}, {"Text: ": "Thank you for the clarification! What's the best place / way to make UI suggestions?", "Images: ": []}, {"Text: ": "@grishka @grishka Github issues are mostly for bug reports. Features that require new UI, as well as any other UI changes, are decided upon centrally and implemented in both iOS and Android apps more or less at the same time. This is also the reason why I don't merge pull requests that change the UI or add to it. Github issues are mostly for bug reports. Features that require new UI, as well as any other UI changes, are decided upon centrally and implemented in both iOS and Android apps more or less at the same time. This is also the reason why I don't merge pull requests that change the UI or add to it. So what you're saying is that third party contributors to this repository should consider themselves confined to bug fixes, as UI changes are managed centrally? As per#271can you please add a contributions policy that clarifies these boundaries of what third party contributors can do? I'd really like to be able to contribute to this application, but I'm not going to put the effort in without knowing you'll accept my changes. And with the new influx it's possible the volume of issues will grow beyond what your team can manage without outside contributors. #271", "Images: ": []}, {"Text: ": "Github issues are mostly for bug reports. Features that require new UI, as well as any other UI changes, are decided upon centrally and implemented in both iOS and Android apps more or less at the same time. This is also the reason why I don't merge pull requests that change the UI or add to it. Github issues are mostly for bug reports. Features that require new UI, as well as any other UI changes, are decided upon centrally and implemented in both iOS and Android apps more or less at the same time. This is also the reason why I don't merge pull requests that change the UI or add to it. I don't understand the concept here. The android version is onv1.1.3vs iOS being onv1.4.5(3 feature versions higher, assuming semver). On iOS the respective issue came up only recently while this one has been around for half a year.mastodon/mastodon-ios#479 v1.1.3 v1.4.5  mastodon/mastodon-ios#479", "Images: ": []}, {"Text: ": "@grishkasomeone volunteered their labour for you, and you rejected it because of contribution policies you have never clarified. @grishka It is six months later, and the application is still lacking this very foundational feature. Even though if you actually collaborated with the community, I'm guessing the pull request could easily have been adapted to be what you want. I've been using the official Android application even though every post I ever sees says that other applications are better, because I want to contribute and improve it. I'm just about to give up that idea because the lack of communication here does not give me confidence that it's a good use of my time. My take is if you're not going to engage with the community, if this is the communication model you think is appropriate, you'd be doing the Mastodon ecosystem a favour if you shut this application down in favour of focusing on the web application, and let third parties continue to build better phone applications.", "Images: ": []}, {"Text: ": "Github issues are mostly for bug reports. Features that require new UI, as well as any other UI changes, are decided upon centrally and implemented in both iOS and Android apps more or less at the same time. This is also the reason why I don't merge pull requests that change the UI or add to it.I don't understand the concept here. The android version is onv1.1.3vs iOS being onv1.4.5(3 feature versions higher, assuming semver). On iOS the respective issue came up only recently while this one has been around for half a year.mastodon/mastodon-ios#479 Github issues are mostly for bug reports. Features that require new UI, as well as any other UI changes, are decided upon centrally and implemented in both iOS and Android apps more or less at the same time. This is also the reason why I don't merge pull requests that change the UI or add to it. Github issues are mostly for bug reports. Features that require new UI, as well as any other UI changes, are decided upon centrally and implemented in both iOS and Android apps more or less at the same time. This is also the reason why I don't merge pull requests that change the UI or add to it. I don't understand the concept here. The android version is onv1.1.3vs iOS being onv1.4.5(3 feature versions higher, assuming semver). On iOS the respective issue came up only recently while this one has been around for half a year.mastodon/mastodon-ios#479 v1.1.3 v1.4.5 mastodon/mastodon-ios#479 And the feature has apparently been added to the iOS version in the meantime:mastodon/mastodon-ios#479 (comment)  mastodon/mastodon-ios#479 (comment)", "Images: ": []}, {"Text: ": "someone volunteered their labour for you, and you rejected it because of contribution policies you have never clarified. someone volunteered their labour for you, and you rejected it because of contribution policies you have never clarified. But they did it without first asking whether the results of that labor would be useful for me. It is six months later, and the application is still lacking this very foundational feature. It is six months later, and the application is still lacking this very foundational feature. This app is for new users. There are more advanced apps for more advanced users. Even though if you actually collaborated with the community, I'm guessing the pull request could easily have been adapted to be what you want. Even though if you actually collaborated with the community, I'm guessing the pull request could easily have been adapted to be what you want. Except the bookmarks feature is not currently planned and I don't know if or when it will be. Or if it will be, it might end up looking and/or working another way entirely. My take is if you're not going to engage with the community My take is if you're not going to engage with the community I'll say it again: this is not a community project. It is acentrally managedopen-source project. Its direction and feature set is not decided by the community. The community is still welcome to make suggestions, report bugs and create pull requests that fix them. centrally managed you'd be doing the Mastodon ecosystem a favour if you shut this application down in favour of focusing on the web application, and let third parties continue to build better phone applications. you'd be doing the Mastodon ecosystem a favour if you shut this application down in favour of focusing on the web application, and let third parties continue to build better phone applications. \"Better\" is subjective. This app is for new users. The minimal feature set is purposeful.", "Images: ": []}, {"Text: ": "And yes you're right that there needs to be a contribution policy.", "Images: ": []}, {"Text: ": "someone volunteered their labour for you, and you rejected it because of contribution policies you have never clarified.But they did it without first asking whether the results of that labor would be useful for me.It is six months later, and the application is still lacking this very foundational feature.This app is for new users. There are more advanced apps for more advanced users.Even though if you actually collaborated with the community, I'm guessing the pull request could easily have been adapted to be what you want.Except the bookmarks feature is not currently planned and I don't know if or when it will be. Or if it will be, it might end up looking and/or working another way entirely.My take is if you're not going to engage with the communityI'll say it again: this is not a community project. It is acentrally managedopen-source project. Its direction and feature set is not decided by the community. The community is still welcome to make suggestions, report bugs and create pull requests that fix them.you'd be doing the Mastodon ecosystem a favour if you shut this application down in favour of focusing on the web application, and let third parties continue to build better phone applications.\"Better\" is subjective. This app is for new users. The minimal feature set is purposeful. someone volunteered their labour for you, and you rejected it because of contribution policies you have never clarified. someone volunteered their labour for you, and you rejected it because of contribution policies you have never clarified. But they did it without first asking whether the results of that labor would be useful for me. It is six months later, and the application is still lacking this very foundational feature. It is six months later, and the application is still lacking this very foundational feature. This app is for new users. There are more advanced apps for more advanced users. Even though if you actually collaborated with the community, I'm guessing the pull request could easily have been adapted to be what you want. Even though if you actually collaborated with the community, I'm guessing the pull request could easily have been adapted to be what you want. Except the bookmarks feature is not currently planned and I don't know if or when it will be. Or if it will be, it might end up looking and/or working another way entirely. My take is if you're not going to engage with the community My take is if you're not going to engage with the community I'll say it again: this is not a community project. It is acentrally managedopen-source project. Its direction and feature set is not decided by the community. The community is still welcome to make suggestions, report bugs and create pull requests that fix them. centrally managed you'd be doing the Mastodon ecosystem a favour if you shut this application down in favour of focusing on the web application, and let third parties continue to build better phone applications. you'd be doing the Mastodon ecosystem a favour if you shut this application down in favour of focusing on the web application, and let third parties continue to build better phone applications. \"Better\" is subjective. This app is for new users. The minimal feature set is purposeful. Thank you for the clarification! That means \"back to Tusky\" for me personally, but for others the minimal starting point into Mastodon might just be the right thing 👍.", "Images: ": []}, {"Text: ": "@grishka @grishka This app is for new users. There are more advanced apps for more advanced users. This app is for new users. There are more advanced apps for more advanced users. Where is this position made clear? In comments of Github issues is not really useful. I just had a look at the Play Store listing. The listing says nothing about that. This is the Mastodon official Android application. It's reasonable to expect it to provide the full Mastodon experience. If it's purposefully not going to, make that clear in the Play Store listing. Make it clear in the README.md of this repository. Make it clear in the official blog post that readme links to. Maybe even name the application to reflect that. Mastodon Basic or something. As it stands, people are going to install this application expecting the full experience, and then be really confused as people in their timelines tell them to do things like make their replies Unlisted that the application does not and apparently will not support. Except the bookmarks feature is not currently planned and I don't know if or when it will be. Or if it will be, it might end up looking and/or working another way entirely. Except the bookmarks feature is not currently planned and I don't know if or when it will be. Or if it will be, it might end up looking and/or working another way entirely. But you've already told us that \"Features that require new UI, as well as any other UI changes, are decided upon centrally and implemented in both iOS and Android apps more or less at the same time.\", and as permastodon/mastodon-ios#479 (comment)this feature has been implemented in iOS. mastodon/mastodon-ios#479 (comment) Communication is the key here. If it had been made clear the mobile applications are deliberately a subset of the full set of functionality, I would have known it wasn't the application for me.", "Images: ": []}, {"Text: ": "I asked Eugen and I will implement bookmarks the same way they work on iOS.", "Images: ": []}, {"Text: ": "Thanks@grishka. As far as the rest of my comments go, it'd be appreciated if you did follow up on making it clearer this application only supports a subset of full Mastodon functionality, and if a contribution policy was put together. @grishka", "Images: ": []}]}, {"App Name": "Mastodon", "Request Number": "#21", "Title": "Missing Delete and Redraft feature", "Author": "imto1", "Posted Time": "Apr 15, 2022", "Last Comment Time": "May 26, 2022", "Initial Comment": "I can't see Delete and Redraft feature on Mastodon android. It's very useful feature for editing previously posted toots. It will be good to add this feature to your android app.", "CommitURL": "N/a", "Number of comments": 4, "CommentatorsNames": ["imto1", "imto1", "carlosala", "sk22", "Gargron"], "Number of Commentators": 5, "All Comments": [{"Text: ": "I can't see Delete and Redraft feature on Mastodon android. It's very useful feature for editing previously posted toots. It will be good to add this feature to your android app.", "Images: ": []}, {"Text: ": "", "Images: ": ["https://user-images.githubusercontent.com/43239919/163548378-84c23416-1a6c-469a-989c-6053a477b344.jpg"]}, {"Text: ": "Since v3.5 of Mastodon there's an option to properly edit toots, but it's currently disabled in the webapp and native apps until next version, to give time to instances to update. Probably this option is not going to make any sense after this change (in my opinion, obviously)", "Images: ": []}, {"Text: ": "possible implementation:master...sk22:feature/delete-redraft- not ideal, i guess, but it works!(now available in my fork's latest release:https://github.com/sk22/mastodon-android-fork/releases) master...sk22:feature/delete-redraft master...sk22:feature/delete-redraft  https://github.com/sk22/mastodon-android-fork/releases", "Images: ": []}, {"Text: ": "Yes, since we already added edits to the API, it makes no sense to work on delete & redraft in the apps.", "Images: ": []}]}, {"App Name": "Mastodon", "Request Number": "#122", "Title": "Feature: Share own profile", "Author": "realpixelcode", "Posted Time": "May 4, 2022", "Last Comment Time": "May 13, 2022", "Initial Comment": "It should be possible to share one own profile's link from the app.", "CommitURL": "/mastodon/mastodon-android/commit/68d086200803d91348586f54407b9f45af5bda0a/hovercard", "Number of comments": 0, "CommentatorsNames": ["realpixelcode"], "Number of Commentators": 1, "All Comments": [{"Text: ": "It should be possible to share one own profile's link from the app.", "Images: ": []}]}, {"App Name": "Mastodon", "Request Number": "#8", "Title": "Add local and federated timeline", "Author": "Discostu36", "Posted Time": "Apr 14, 2022", "Last Comment Time": "May 14, 2022", "Initial Comment": "At the moment there seems to be no way to access local and federated timeline. Please consider adding that feature.", "CommitURL": "https://github.com/mastodon/mastodon-android/commit/318d271127be441ada22cff9d96ec74fcaa3d873/hovercard", "Number of comments": 17, "CommentatorsNames": ["Discostu36", "dermitdemdino", "FediVideos", "Akselmo", "vilbi", "dusnm", "FediVideos", "lesion", "afk-mario", "oufmilo", "grishka", "Gargron", "yoshimo", "Gargron", "sk22", "Doomsdayrs", "thekalinga", "nemobis"], "Number of Commentators": 18, "All Comments": [{"Text: ": "At the moment there seems to be no way to access local and federated timeline. Please consider adding that feature.", "Images: ": []}, {"Text: ": "Without this feature, the app can only be used to a very limited extent.", "Images: ": []}, {"Text: ": "At least have the local timeline, it is important for community-building on smaller instances, and smaller instances are what keep Mastodon from turning into Twitter. If we just cater to big instances, the network will be vulnerable to being bought up, and all our efforts will be pointless.", "Images: ": []}, {"Text: ": "Dont really see a point using this app without the local timeline.", "Images: ": []}, {"Text: ": "Good design, but in the last smalll new users waves in Germany I was in contact to several New Accounts using the android Mastodon APP. They totally misunderstood the mastodon decentral aspect, as they don\"t get the chance to feel it via this app and I failed explaining until I recognized, it's the app. People who have the spontaneous mood to try a 'new' social Network with a new app, don't like to be told, nice try, do it again, as the official app is only giving you a distortion of reality.So add Local and Federated timeline, otherwise the approach of decentral instances and so a diverse alternative network will die and mastodon.social will be as social as Twitter.", "Images: ": []}, {"Text: ": "On one hand I do understand the motivation in removing these timelines and I can begrudgingly accept that it probably is the best option for users coming from twitter. On the other hand I can't help, but feel this betrays the already existing user base, especially the users from smaller instances. The whole point of the Local timeline is to have a space for discussion with like minded people. That's why we have communities built around different themes. In essence that's exactly what separates Mastodon from Twitter. I don't want just an open source version of Twitter, that's not what I signed up for. I feel there could be a sort of compromise here. Instead of outright removing the Local and Federated timelines, just hide them by default. That way people who know about them can use them, others don't even have to be aware of their existence.", "Images: ": []}, {"Text: ": "It seems like the problem is this: On large instances, the risks of a Local timeline outweigh the benefits. On large instances, the Local timeline is a firehose just like Federated, impossible to read and full of potentially nasty content but impossible to browse for fun. Seems like a no-brainer to zap Local. On small instances, it's the other way around. The benefits of a Local timeline outweigh the risks, it's not a firehose, it helps build the community and people are much less likely to see nasty content because the moderators have better control over troublemakers. Removing Local seems like a bad idea. I'm not sure how this situation can be resolved, maybe Local could be for instances below a certain size?", "Images: ": []}, {"Text: ": "I'm not sure how this situation can be resolved, maybe Local could be for instances below a certain size? I'm not sure how this situation can be resolved, maybe Local could be for instances below a certain size? it depends on what kind of instances you want to focus on, if decentralize is the point we need to privilege small instances.", "Images: ": []}, {"Text: ": "You can access the local timeline under search/community", "Images: ": []}, {"Text: ": "I thinkglobal timelineis very important for smaller  instance. You need this to discover other people and to expand your visibility. global timeline", "Images: ": []}, {"Text: ": "Local timeline was added (search -> community), and I believe there are no plans to add the federated timeline (@Gargroncorrect me if I'm wrong). One issue with adding a federated timeline is that it's more-or-less unmoderated and thus adds a non-zero risk of app stores, especially Google Play, rejecting the app over something outside of our control. @Gargron", "Images: ": []}, {"Text: ": "I thinkglobal timelineis very important for smaller instance. You need this to discover other people and to expand your visibility. I thinkglobal timelineis very important for smaller instance. You need this to discover other people and to expand your visibility. global timeline The explore tab is in essence a moderated, quality-filtered federated timeline. Its purpose is to help you discover other people and expand your visibility, but without being a vector for spam and abuse.", "Images: ": []}, {"Text: ": "One issue with adding a federated timeline is that it's more-or-less unmoderated and thus adds a non-zero risk of app stores, especially Google Play, rejecting the app over something outside of our control. One issue with adding a federated timeline is that it's more-or-less unmoderated and thus adds a non-zero risk of app stores, especially Google Play, rejecting the app over something outside of our control. Do you have a specific play store rule in mind for that?", "Images: ": []}, {"Text: ": "One issue with adding a federated timeline is that it's more-or-less unmoderated and thus adds a non-zero risk of app stores, especially Google Play, rejecting the app over something outside of our control.Do you have a specific play store rule in mind for that? One issue with adding a federated timeline is that it's more-or-less unmoderated and thus adds a non-zero risk of app stores, especially Google Play, rejecting the app over something outside of our control. One issue with adding a federated timeline is that it's more-or-less unmoderated and thus adds a non-zero risk of app stores, especially Google Play, rejecting the app over something outside of our control. Do you have a specific play store rule in mind for that? Examples from Mastodon apps specifically: Tusky has been removed from the Play StoreFedilab has been removed from the Play StoreSubway Tooter threatened to be removed from the Play Store Tusky has been removed from the Play Store Tusky has been removed from the Play Store Fedilab has been removed from the Play Store Fedilab has been removed from the Play Store Subway Tooter threatened to be removed from the Play Store Subway Tooter threatened to be removed from the Play Store Examples from other decentralized apps: Element has been removed from the Play Store Element has been removed from the Play Store Element has been removed from the Play Store Examples from non-decentralized apps with user generated content: Tumblr removed from the Apple App Store Tumblr removed from the Apple App Store Tumblr removed from the Apple App Store While all of them have been reinstated since with varying degrees of changes (Tumblr ended up banning all adult content from its platform altogether to avoid the issue), it is evident that Google (and Apple) hold apps accountable for user-generated content.", "Images: ": []}, {"Text: ": "This commit of mine318d271implements the federated timeline - you can use my fork (which I don't plan to release on the Play Store anyway), which has this and more features the official app won't implement:https://github.com/sk22/mastodon-android-fork#changes 318d271 318d271 https://github.com/sk22/mastodon-android-fork#changes", "Images: ": []}, {"Text: ": "There is now a conception going around, from users using the official Mastodon application, that once you join an instance, you're in an echo chamber. If smaller developers of Tusky can get their application back on the play store, Then larger organizations such as Mastodon should have no problem negotiating with larger corporations. Example of Misconceptions being spread.https://mobile.twitter.com/VeryBadLlama/status/1589086085380190209  https://mobile.twitter.com/VeryBadLlama/status/1589086085380190209", "Images: ": []}, {"Text: ": "I'm not sure why this issue is closed. All the links posted by@Gargronare resolved. @Gargron What Play Store & Apple Store did makes no sense & so does the reasons provided. If paedophiles watch child porn on chrome browser/safari in their mobiles (which they do), are Google/Apple going to remove these browsers from the store? Browser is just a client. It has no obligation to spy on users as to what content they are watching (if it spies, no one will use it even for legitimate purpose, let alone pedos). This client app is just a tool to connect to any mastodon server & load content. Since the app got no control over the servers (nor should it), there is no good reason to ban official Mastodon app, let alone other clients. Here are my reasons why they cant ban this app for meeting basic expectations What Apple & Google did makes no sense (explanation above)Since mastodon has good visibility now, there will be tremendous public pressure to back offMany lawyers would be willing to fight against unjust ban (if Big Tech bullies bans) What Apple & Google did makes no sense (explanation above) Since mastodon has good visibility now, there will be tremendous public pressure to back off Many lawyers would be willing to fight against unjust ban (if Big Tech bullies bans) These Big tech bullies must have assumed people wont complain if they bully app developers (which they know they can do, thanks to \"legal\" monopolies they have which they ensured thru bribes to politicians to not break these monopolies), but since mastodon is mainstream app, they cant bully that easily now. Incase of twitter, the data is stored on twitter servers. So, Apple & Google can bully. But incase of mastodon, the app has no business to know which instance its talking to & what content is being stored in it. So, this app cant be held liable to for any harmful content. If issue is the threat of banning (which imo is not a legitimate concern), why not publish multiple versions of app to playstore, where new development happens on a canary version (to test waters in playstore with all experimental features), while main app is still available for download incase if canary version is banned (unlikely)? & also publish same canary version to non-google repos too, but still certified by repo maintainers to be malware free, so people can still install it if BTB take it down & the issue is being litigated, people can still download feature rich app? And this allows stability in the main branch too so features can be promoted to main app if the feature is liked by people & is stable enough.", "Images: ": []}, {"Text: ": "a vector for spam and abuse a vector for spam and abuse I understand this concern on giant instances like mastodon.social, where there will always be something improper in the federated timeline, but the experience on other instances is very different. Some options could be: make the federated timeline available only for smaller instances (under 500 active users?),make the federated timeline available only for instances with closed registration/registration by application,only show posts older than 8 hours (or whatever) on the federated timeline, so that there's time to moderate them;give some control to instance admins to decide whether the federated timeline will be shown to their users. make the federated timeline available only for smaller instances (under 500 active users?), make the federated timeline available only for instances with closed registration/registration by application, only show posts older than 8 hours (or whatever) on the federated timeline, so that there's time to moderate them; give some control to instance admins to decide whether the federated timeline will be shown to their users. Of course at the moment mastodon.social looms largemastodon/mastodon-ios#1023 (comment)but in the future if the app gives more choice to users again we'll be able to see whether access to the federated timeline makes a difference in terms of user retention etc. mastodon/mastodon-ios#1023 (comment)", "Images: ": []}]}, {"App Name": "Mastodon", "Request Number": "#29", "Title": "Pinned toots are not shown in profile", "Author": "carlosala", "Posted Time": "Apr 17, 2022", "Last Comment Time": "Jun 25, 2023", "Initial Comment": "Title is quite descriptive", "CommitURL": "N/a", "Number of comments": 0, "CommentatorsNames": ["carlosala", "grishka"], "Number of Commentators": 2, "All Comments": [{"Text: ": "Title is quite descriptive", "Images: ": []}, {"Text: ": "The upcoming redesigned UI adds pinned posts and featured hashtags in profiles.", "Images: ": ["https://private-user-images.githubusercontent.com/1478258/248525501-1d70237a-1f68-4ea2-a4f3-d4ce9381cd48.png?jwt=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpc3MiOiJnaXRodWIuY29tIiwiYXVkIjoicmF3LmdpdGh1YnVzZXJjb250ZW50LmNvbSIsImtleSI6ImtleTUiLCJleHAiOjE3Mjc5OTU3NTQsIm5iZiI6MTcyNzk5NTQ1NCwicGF0aCI6Ii8xNDc4MjU4LzI0ODUyNTUwMS0xZDcwMjM3YS0xZjY4LTRlYTItYTRmMy1kNGNlOTM4MWNkNDgucG5nP1gtQW16LUFsZ29yaXRobT1BV1M0LUhNQUMtU0hBMjU2JlgtQW16LUNyZWRlbnRpYWw9QUtJQVZDT0RZTFNBNTNQUUs0WkElMkYyMDI0MTAwMyUyRnVzLWVhc3QtMSUyRnMzJTJGYXdzNF9yZXF1ZXN0JlgtQW16LURhdGU9MjAyNDEwMDNUMjI0NDE0WiZYLUFtei1FeHBpcmVzPTMwMCZYLUFtei1TaWduYXR1cmU9Y2E1MTY5MGE2ZmE4M2JhY2NjZWQ4ODIyNmQzZGQzOTI2ZTE0Yzc3YTYzMGI2ODEzMzQxZWJmZTMzMmE2MDY2ZiZYLUFtei1TaWduZWRIZWFkZXJzPWhvc3QifQ.Kd0MKrzdGMt5bhKj0ird_pvAhjAyplVr2Tfry0Q-VaU"]}]}, {"App Name": "Mastodon", "Request Number": "#146", "Title": "Feature: Search tab: Scroll to top by clicking on tab", "Author": "realpixelcode", "Posted Time": "May 7, 2022", "Last Comment Time": "May 13, 2022", "Initial Comment": "In the search tab, there are tabs for posts, hashtags, news etc. It should be possible to scroll back to the top by clicking on the respective tab's title.", "CommitURL": "/mastodon/mastodon-android/commit/c9e13eefa5427f90722a7bb68aeb429fc19c0dbf/hovercard", "Number of comments": 0, "CommentatorsNames": ["realpixelcode"], "Number of Commentators": 1, "All Comments": [{"Text: ": "In the search tab, there are tabs for posts, hashtags, news etc. It should be possible to scroll back to the top by clicking on the respective tab's title.", "Images: ": []}]}, {"App Name": "Mastodon", "Request Number": "#42", "Title": "Make view from timeline back", "Author": "Decodetalkers", "Posted Time": "Apr 19, 2022", "Last Comment Time": "May 14, 2022", "Initial Comment": "I like this , because it makes me feel I am not alone on then earth. Every time I view the post from different from the timeline, I can feel they are all alive, not only me. Every time, every second, I can meet new friend, maybe he is in Japan, having dinner, or In French.\nNow the feature of viewing from timeline is not in mastondon-android. I like the hot trending, then I can know what people are talking now. But I feel lonely when use your app. I find out that it is because I cannot always read a new post, cannot always know who may be will be my friend, what he is doing ,worring. So I need this feature.", "CommitURL": "N/a", "Number of comments": 8, "CommentatorsNames": ["Decodetalkers", "Decodetalkers", "Gargron", "Decodetalkers", "realpixelcode", "Decodetalkers", "Gargron", "grishka", "Decodetalkers"], "Number of Commentators": 9, "All Comments": [{"Text: ": "I like this , because it makes me feel I am not alone on then earth. Every time I view the post from different from the timeline, I can feel they are all alive, not only me. Every time, every second, I can meet new friend, maybe he is in Japan, having dinner, or In French. Now the feature of viewing from timeline is not in mastondon-android. I like the hot trending, then I can know what people are talking now. But I feel lonely when use your app. I find out that it is because I cannot always read a new post, cannot always know who may be will be my friend, what he is doing ,worring. So I need this feature.", "Images: ": []}, {"Text: ": "I don't mind mastondon being a second twitter, but although it is twitter, twitter also have the Option to view from the timeline.", "Images: ": []}, {"Text: ": "When you follow people you will get their new posts in your home feed.", "Images: ": []}, {"Text: ": "When you follow people you will get their new posts in your home feed. When you follow people you will get their new posts in your home feed. But without timeline ,how can I follow interesting people? And what about the chance for the post of a nobody be seen by another ?", "Images: ": []}, {"Text: ": "twitter also have the Option to view from the timeline. twitter also have the Option to view from the timeline. What exactly do you mean by “view from timeline”?", "Images: ": []}, {"Text: ": "twitter also have the Option to view from the timeline.What exactly do you mean by “view from timeline”? twitter also have the Option to view from the timeline. twitter also have the Option to view from the timeline. What exactly do you mean by “view from timeline”? Sorry , I may got a mistake. The timeline of twitter is only for who your follow..I don't use twitter frequently. My friend has show the feature of twitter, then I mistake twitter has this feature", "Images: ": []}, {"Text: ": "But without timeline ,how can I follow interesting people? But without timeline ,how can I follow interesting people? Check the explore tab!", "Images: ": []}, {"Text: ": "Is this issue about something meaningful, or is it safe to close?", "Images: ": []}, {"Text: ": "Is this issue about something meaningful, or is it safe to close? Is this issue about something meaningful, or is it safe to close? Yes,I will close", "Images: ": []}]}, {"App Name": "Mastodon", "Request Number": "#89", "Title": "Missing lists", "Author": "retiolus", "Posted Time": "Apr 27, 2022", "Last Comment Time": "Oct 8, 2023", "Initial Comment": "Cannot create lists and also unable to create lists. Please add this feature to Mastodon android.\nThanks.", "CommitURL": "/mastodon/mastodon-android/commit/dff2217e808b9f87554fd73e6f36490f50e04442/hovercard", "Number of comments": 3, "CommentatorsNames": ["retiolus", "Gargron", "brimwats", "pauljacobson"], "Number of Commentators": 4, "All Comments": [{"Text: ": "Cannot create lists and also unable to create lists. Please add this feature to Mastodon android.Thanks.", "Images: ": []}, {"Text: ": "This is planned.", "Images: ": []}, {"Text: ": "still a major missing feature, fwiw I haven't found a client that does provide this.", "Images: ": []}, {"Text: ": "I'd also love to see this in the Android app. I add people I follow to lists and because I use a mobile app more frequently, I'd really like to at least be able to have the same list management and list view options in the Mastodon app for Android that we have in the web app. Is there a roadmap for the mobile apps,@Gargron? @Gargron", "Images: ": []}]}]